<template>
  <v-container>
    <v-card color="#ffffff">
      <v-card-title>О программе</v-card-title>
      <v-card-text>
        <p class="grey--text">
          В данной программе возможно посмотреть количество брендированных
          автомобилей:
          <ul> 
           <li>по месяцам;</li>
           <li>на конкретную дату (пока только 1 числа
          месяца и каждая среда).</li> 
          </ul>
        </p>
        <p class="grey--text">
          Количество автомобилей считается по подразделению автомобиля и
          установленной на нем галки "Реклама" или "Наклейка". Если у автомобиля
          подразделение подключение вашего города, а подразделение автомобиля
          другое, то авто будет считаться брендированным в другом подразделении.
          Поэтому необходимо подддерживать подразделение автомобиля в актуальном
          состоянии;
        </p>
      </v-card-text>
      <v-card-title>Релизы</v-card-title>
      <v-card-text>
        <p class="grey--text">
          Релиз от 19.11.2021
          <ul> 
           <li>в боковом меню исправлена подсветка активной
          страницы;</li>
           <li>реализована страница с топами и анти-топами по городам;</li>
           <li>В таблицах зафиксированны поля (город в странах, тип в городах);</li>  
          </ul> 
        </p>
        <v-divider></v-divider>
        <p class="grey--text">
          Релиз от 14.12.2021
          <ul> 
           <li>при выходе из системы происходит очистка всех данные из store;</li>
           <li>разработана архитектура пользовательских данных;</li>
           <li>реализованы роли пользователей "admin" и "user";</li>
           <li>реализована возможность добавление всех городов в форме выдачи доступа</li>
           <li>реализована возможность удаления всех городов в форме выдачи доступа;</li>
           <li>для роли admin создана страница с добавлением/удаление доступа у пользователей;</li>
           <li>для user создана страница профиля с пользовательскими данными и доступными странами и городами;</li>  
          </ul> 
        </p>
      </v-card-text>
    </v-card>
  </v-container>
</template>

<script>
export default {};
</script>

<style>
</style>